app/views/challenges/_form.html.erb

    <%= form.label :category_id, class: "form-label" %>
    <%= form.collection_select :category_id, Category.all, :id, :name, { class: "input-field" } %>
---
SELECT "categories".* FROM "categories"