app/controllers/activities_controller.rb

  def create
    @activity = @challenge.activities.build(activity_params)

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("note", "amount", "challenge_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["note", "I did it!"], ["amount", 2], ["challenge_id", 5], ["created_at", "2023-02-17 19:23:27.684124"], ["updated_at", "2023-02-17 19:23:27.684124"]]

  def update
    respond_to do |format|
      if @activity.update(activity_params)
---
UPDATE "activities" SET "amount" = ?, "updated_at" = ? WHERE "activities"."id" = ?  [["amount", 5], ["updated_at", "2023-03-05 00:46:57.626458"], ["id", 20]]

    def set_activity
      @activity = @challenge.activities.find(params[:id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."challenge_id" = ? AND "activities"."id" = ? LIMIT ?  [["challenge_id", 1], ["id", 1], ["LIMIT", 1]]

    def set_challenge
      @challenge = Challenge.find(params[:challenge_id])
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]