app/controllers/challenges_controller.rb

INSERT INTO "challenges" ("name", "category_id", "goal", "progress", "ends_at", "created_at", "updated_at", "units") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @challenge = Challenge.new(challenge_params)

    respond_to do |format|
      if @challenge.save

UPDATE "challenges" SET "goal" = ?, "progress" = ?, "ends_at" = ?, "updated_at" = ? WHERE "challenges"."id" = ?  [["goal", 5], ["progress", 5], ["ends_at", "2023-02-14"], ["updated_at", "2023-02-17 19:08:58.262969"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @challenge.update(challenge_params)

DELETE FROM "challenges" WHERE "challenges"."id" = ?  [["id", 3]]
---
  def destroy
    @challenge.destroy