app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email]) #.downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "jy242@duke.edu"], ["LIMIT", 1]]