app/views/activities/_activity_listing.html.erb


  <%= button_to activity.destroy, "delete",
    # params: { activity: { id: activity.id }},
    method: :destroy,
    form_class: "inline-block",
    class: "rounded-sm ml-5 py-1 px-2 bg-gray-100 inline-block font-small"
---
DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 1]]