app/views/activities/_form.html.erb

    <%= form.label :challenge_id %>
    <%= form.collection_select :challenge_id, Challenge.all, :id, :name, { class: "input-field" } %>
---
SELECT "challenges".* FROM "challenges"